results/MySQL/Broadwell/events/noDyni-oltp.log
sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            731430
        write:                           0
        other:                           104490
        total:                           835920
    transactions:                        52245  (870.70 per sec.)
    queries:                             835920 (13931.24 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0012s
    total number of events:              52245

Latency (ms):
         min:                                  0.98
         avg:                                  1.15
         max:                                  2.84
         95th percentile:                      1.18
         sum:                              59954.27

Threads fairness:
    events (avg/stddev):           52245.0000/0.00
    execution time (avg/stddev):   59.9543/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1410038
        write:                           0
        other:                           201434
        total:                           1611472
    transactions:                        100717 (1678.53 per sec.)
    queries:                             1611472 (26856.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0010s
    total number of events:              100717

Latency (ms):
         min:                                  0.96
         avg:                                  1.19
         max:                                  2.54
         95th percentile:                      1.34
         sum:                             119861.23

Threads fairness:
    events (avg/stddev):           50358.5000/1101.50
    execution time (avg/stddev):   59.9306/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2549386
        write:                           0
        other:                           364198
        total:                           2913584
    transactions:                        182099 (3034.81 per sec.)
    queries:                             2913584 (48556.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0014s
    total number of events:              182099

Latency (ms):
         min:                                  1.15
         avg:                                  1.32
         max:                                  3.14
         95th percentile:                      1.34
         sum:                             239570.38

Threads fairness:
    events (avg/stddev):           45524.7500/116.03
    execution time (avg/stddev):   59.8926/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3212286
        write:                           0
        other:                           458898
        total:                           3671184
    transactions:                        229449 (3823.91 per sec.)
    queries:                             3671184 (61182.51 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0017s
    total number of events:              229449

Latency (ms):
         min:                                  1.32
         avg:                                  2.09
         max:                                  6.64
         95th percentile:                      2.14
         sum:                             479497.67

Threads fairness:
    events (avg/stddev):           28681.1250/32.86
    execution time (avg/stddev):   59.9372/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3202500
        write:                           0
        other:                           457500
        total:                           3660000
    transactions:                        228750 (3812.18 per sec.)
    queries:                             3660000 (60994.93 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0029s
    total number of events:              228750

Latency (ms):
         min:                                  1.30
         avg:                                  4.19
         max:                                509.67
         95th percentile:                      4.41
         sum:                             959441.11

Threads fairness:
    events (avg/stddev):           14296.8750/104.64
    execution time (avg/stddev):   59.9651/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3137568
        write:                           0
        other:                           448224
        total:                           3585792
    transactions:                        224112 (3734.69 per sec.)
    queries:                             3585792 (59755.05 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0062s
    total number of events:              224112

Latency (ms):
         min:                                  1.29
         avg:                                  8.56
         max:                               2523.48
         95th percentile:                      9.06
         sum:                            1919493.47

Threads fairness:
    events (avg/stddev):           7003.5000/263.53
    execution time (avg/stddev):   59.9842/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3054142
        write:                           0
        other:                           436306
        total:                           3490448
    transactions:                        218153 (3635.00 per sec.)
    queries:                             3490448 (58160.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0126s
    total number of events:              218153

Latency (ms):
         min:                                  1.32
         avg:                                 17.60
         max:                              12098.63
         95th percentile:                     18.61
         sum:                            3839849.92

Threads fairness:
    events (avg/stddev):           3408.6406/347.22
    execution time (avg/stddev):   59.9977/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2957038
        write:                           0
        other:                           422434
        total:                           3379472
    transactions:                        211217 (3518.61 per sec.)
    queries:                             3379472 (56297.72 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0266s
    total number of events:              211217

Latency (ms):
         min:                                  1.21
         avg:                                 36.37
         max:                              21174.21
         95th percentile:                     41.10
         sum:                            7681317.28

Threads fairness:
    events (avg/stddev):           1650.1328/454.84
    execution time (avg/stddev):   60.0103/0.01